TexasInstruments/mcupsdk-core/examples/drivers/gpmc/gpmc_psram_io/am263x-cc/r5fss0-0_nortos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM263x_beta" --package "ZCZ" --part "AM263x" --context "r5fss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @versions {"tool":"1.18.0+3266"}
 */

/**
 * Import the modules used in this configuration.
 */
const psram           = scripting.addModule("/board/psram/psram", {}, false);
const psram1          = psram.addInstance();
const gpio            = scripting.addModule("/drivers/gpio/gpio", {}, false);
const gpio1           = gpio.addInstance();
const debug_log       = scripting.addModule("/kernel/dpl/debug_log");
const mpu_armv7       = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71      = mpu_armv7.addInstance();
const mpu_armv72      = mpu_armv7.addInstance();
const mpu_armv73      = mpu_armv7.addInstance();
const mpu_armv74      = mpu_armv7.addInstance();
const mpu_armv75      = mpu_armv7.addInstance();
const mpu_armv76      = mpu_armv7.addInstance();
const mpu_armv77      = mpu_armv7.addInstance();
const mpu_armv78      = mpu_armv7.addInstance();
const default_linker  = scripting.addModule("/memory_configurator/default_linker", {}, false);
const default_linker1 = default_linker.addInstance();
const general         = scripting.addModule("/memory_configurator/general", {}, false);
const general1        = general.addInstance();
const region          = scripting.addModule("/memory_configurator/region", {}, false);
const region1         = region.addInstance();
const section         = scripting.addModule("/memory_configurator/section", {}, false);
const section1        = section.addInstance();
const section2        = section.addInstance();
const section3        = section.addInstance();
const section4        = section.addInstance();
const section5        = section.addInstance();
const section6        = section.addInstance();
const section7        = section.addInstance();
const section8        = section.addInstance();
const section9        = section.addInstance();
const section10       = section.addInstance();
const section11       = section.addInstance();
const section12       = section.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
psram1.$name                                 = "CONFIG_PSRAM0";
psram1.psramDriverIoExpander.$name           = "CONFIG_I2C0";
psram1.psramDriverIoExpander.I2C.$assign     = "I2C2";
psram1.psramDriverIoExpander.I2C.SDA.pu_pd   = "pd";
psram1.psramDriver.$name                     = "CONFIG_GPMC0";
psram1.psramDriver.clockRateDiv              = 4;
psram1.psramDriver.GPMC.$assign              = "GPMC";
psram1.psramDriver.GPMC.GPMC_OEn_REn.pu_pd   = "pu";
psram1.psramDriver.GPMC.GPMC_OEn_REn.$assign = "PR0_PRU1_GPIO5";
psram1.psramDriver.GPMC.GPMC_ADVn_ALE.pu_pd  = "pu";
psram1.psramDriver.GPMC.GPMC_WEn.$assign     = "PR0_PRU1_GPIO8";
psram1.psramDriver.GPMC.GPMC_BE0n_CLE.pu_pd  = "pu";
psram1.psramDriver.GPMC.GPMC_A0.pu_pd        = "pu";
psram1.psramDriver.GPMC.GPMC_A1.pu_pd        = "pu";
psram1.psramDriver.GPMC.GPMC_A2.pu_pd        = "pu";
psram1.psramDriver.GPMC.GPMC_A3.pu_pd        = "pu";
psram1.psramDriver.GPMC.GPMC_A4.pu_pd        = "pu";
psram1.psramDriver.GPMC.GPMC_A5.pu_pd        = "pu";
psram1.psramDriver.GPMC.GPMC_A6.pu_pd        = "pu";
psram1.psramDriver.GPMC.GPMC_A7.pu_pd        = "pu";
psram1.psramDriver.GPMC.GPMC_A8.pu_pd        = "pu";
psram1.psramDriver.GPMC.GPMC_A9.pu_pd        = "pu";
psram1.psramDriver.GPMC.GPMC_A10.pu_pd       = "pu";
psram1.psramDriver.GPMC.GPMC_A11.pu_pd       = "pu";
psram1.psramDriver.GPMC.GPMC_A12.pu_pd       = "pu";
psram1.psramDriver.GPMC.GPMC_A13.pu_pd       = "pu";
psram1.psramDriver.GPMC.GPMC_A14.pu_pd       = "pu";
psram1.psramDriver.GPMC.GPMC_A15.pu_pd       = "pu";
psram1.psramDriver.GPMC.GPMC_A16.pu_pd       = "pu";
psram1.psramDriver.GPMC.GPMC_A17.pu_pd       = "pu";
psram1.psramDriver.GPMC.GPMC_A18.pu_pd       = "pu";
psram1.psramDriver.GPMC.GPMC_A19.pu_pd       = "pu";
psram1.psramDriver.GPMC.GPMC_A20.pu_pd       = "pu";
psram1.psramDriver.GPMC.GPMC_A21.pu_pd       = "pu";
psram1.psramDriver.GPMC.GPMC_BE1n.pu_pd      = "pu";
psram1.psramDriver.GPMC.GPMC_CSn0.pu_pd      = "pu";
psram1.psramDriver.GPMC.GPMC_CSn0.$assign    = "PR0_PRU1_GPIO14";
psram1.psramDriver.GPMC.GPMC_AD0.pu_pd       = "pu";
psram1.psramDriver.GPMC.GPMC_AD1.pu_pd       = "pu";
psram1.psramDriver.GPMC.GPMC_AD2.pu_pd       = "pd";
psram1.psramDriver.GPMC.GPMC_AD3.pu_pd       = "pu";
psram1.psramDriver.GPMC.GPMC_AD4.pu_pd       = "pu";
psram1.psramDriver.GPMC.GPMC_AD5.pu_pd       = "pu";
psram1.psramDriver.GPMC.GPMC_AD6.pu_pd       = "pu";
psram1.psramDriver.GPMC.GPMC_AD6.$assign     = "UART1_RXD";
psram1.psramDriver.GPMC.GPMC_AD7.pu_pd       = "pu";
psram1.psramDriver.GPMC.GPMC_AD7.$assign     = "UART1_TXD";
psram1.psramDriver.GPMC.GPMC_AD8.pu_pd       = "pu";
psram1.psramDriver.GPMC.GPMC_AD9.pu_pd       = "pu";
psram1.psramDriver.GPMC.GPMC_AD10.pu_pd      = "pu";
psram1.psramDriver.GPMC.GPMC_AD11.pu_pd      = "pu";
psram1.psramDriver.GPMC.GPMC_AD12.pu_pd      = "pu";
psram1.psramDriver.GPMC.GPMC_AD13.pu_pd      = "pu";
psram1.psramDriver.GPMC.GPMC_AD14.pu_pd      = "pu";
psram1.psramDriver.GPMC.GPMC_AD15.pu_pd      = "pu";

gpio1.$name = "CONFIG_GPIO0";

debug_log.enableUartLog            = true;
debug_log.uartLog.$name            = "CONFIG_UART_CONSOLE";
debug_log.uartLog.UART.$assign     = "UART0";
debug_log.uartLog.UART.RXD.$assign = "UART0_RXD";
debug_log.uartLog.UART.TXD.$assign = "UART0_TXD";
debug_log.uartLog.child.$name      = "drivers_uart_v2_uart_v2_template0";

mpu_armv71.$name             = "CONFIG_MPU_REGION0";
mpu_armv71.size              = 31;
mpu_armv71.attributes        = "Device";
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.allowExecute      = false;

mpu_armv72.$name             = "CONFIG_MPU_REGION1";
mpu_armv72.size              = 15;
mpu_armv72.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv73.$name             = "CONFIG_MPU_REGION2";
mpu_armv73.baseAddr          = 0x41010000;
mpu_armv73.size              = 15;
mpu_armv73.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv74.$name             = "CONFIG_MPU_REGION3";
mpu_armv74.baseAddr          = 0x70000000;
mpu_armv74.size              = 21;
mpu_armv74.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv75.$name             = "CONFIG_MPU_REGION4";
mpu_armv75.baseAddr          = 0x60000000;
mpu_armv75.size              = 28;
mpu_armv75.accessPermissions = "Supervisor RD, User RD";

mpu_armv76.$name       = "CONFIG_MPU_REGION5";
mpu_armv76.baseAddr    = 0x80000000;
mpu_armv76.size        = 31;
mpu_armv76.tex         = 0;
mpu_armv76.isCacheable = false;

